# ============================================================================
# Homebrew Bundle File
# ============================================================================

# Taps
tap "oven-sh/bun"
tap "hashicorp/tap"

# Core command-line tools
brew "git"
brew "gcc"
brew "jq"

# Shell
brew "zsh"

# Editors
brew "neovim"

# Development tools
brew "python@3.14"
brew "node"
brew "oven-sh/bun/bun"
brew "yarn"
brew "pnpm"

# DevOps & Infrastructure
brew "ansible"
brew "ansible-lint"
brew "azure-cli"
brew "docker"
brew "opentofu"
brew "hashicorp/tap/packer"
brew "terraform"

# Container orchestration tools
brew "kubernetes-cli"
brew "helm"
brew "helmfile"
brew "k3sup"
brew "k9s"
brew "kubectx"
brew "lazydocker"

# GitHub CLI
brew "gh"

# CLI tools
brew "bat"
brew "btop"
brew "eza"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "starship"
brew "superfile"
brew "zoxide"

# Cask tools
brew install --cask alt-tab
brew install --cask discord
brew install --cask firefox
brew install --cask google-chrome
brew install --cask httpie
brew install --cask lens
brew install --cask microsoft-teams
brew install --cask openlens
brew install --cask orbstack
brew install --cask raycast
brew install --cask slack
brew install --cask spotify
brew install --cask tableplus
brew install --cask visual-studio-code
brew install --cask vlc
brew install --cask warp
brew install --cask zoom
